app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats"
---
  def index
    cats = Cat.all

INSERT INTO "cats" ("name", "age", "enjoys", "created_at", "updated_at", "images") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    # Create a new cat
    cat = Cat.create(cat_params)